In [2]:
data <- read.csv("ds_salaries.csv")
head(data)

  work_year experience_level employment_type job_title                salary
1 2023      SE               FT              Principal Data Scientist  80000
2 2023      MI               CT              ML Engineer               30000
3 2023      MI               CT              ML Engineer               25500
4 2023      SE               FT              Data Scientist           175000
5 2023      SE               FT              Data Scientist           120000
6 2023      SE               FT              Applied Scientist        222200
  salary_currency salary_in_usd employee_residence remote_ratio
1 EUR              85847        ES                 100
2 USD              30000        US                 100
3 USD              25500        US                 100
4 USD             175000        CA                 100
5 USD             120000        CA                 100
6 USD             222200        US                   0
  company_location company_size
1 ES               L
2 US               S
3 US               S
4 CA               M
5 CA               M
6 US               L

In [13]:
library(dplyr)
library(tidyr)
data %>% filter(job_title %in% c("Data Scientist", "Data Engineer")) |>
    group_by(experience_level, job_title, work_year) |>
    summarise(avg = mean(salary)) |>
    spread(work_year, avg)

`summarise()` has grouped output by 'experience_level', 'job_title'. You can
override using the `.groups` argument.

  experience_level job_title      2020       2021      2022     2023
1 EN               Data Engineer  1624500.00  681750.0 106992.0 137580.6
2 EN               Data Scientist   50366.67  481440.0 419199.1 290291.6
3 EX               Data Engineer    70000.00        NA 234700.0 203898.2
4 EX               Data Scientist         NA        NA 144500.0 187875.0
5 MI               Data Engineer    87614.14   97563.1 124665.7 117880.2
6 MI               Data Scientist 1333010.00 1427335.4 226889.1 157434.7
7 SE               Data Engineer   316666.67  134045.5 148010.0 158970.5
8 SE               Data Scientist  168000.00  603840.0 151688.1 167621.1